Revit 2027 API
Workset.Kind Property
 Kind of the workset.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public WorksetKind Kind { get; }
Public ReadOnly Property Kind As WorksetKind
	Get
public:
property WorksetKind Kind {
	WorksetKind get ();
}
member Kind : WorksetKind with get
Property Value
WorksetKind
See Also
Reference
Workset Class
Autodesk.Revit.DB Namespace